cls_questions = [
    "这道菜的名称是什么？",
    "图片中这道菜的名称是什么？",
    "你能告诉我这道菜的名字吗？",
    "这是什么菜？",
    "你能告诉我这道菜的名称吗？",
    "这道菜的烹饪名称是什么？",
    "你能提供这道菜的名称吗？",
    "图片中展示的这道菜属于哪个类别？",
    "你能识别出照片中展示的这道菜吗？",
    "图片中描绘的是哪道菜？"
]

ingre_questions = [
    "你能识别出这张图片中的食材吗？",
    "这张图片中有哪些食材？",
    "请检测这张照片中的食材。",
    "你能从这张照片中分辨出哪些食材吗？",
    "你能从这张图片中识别出食材吗？",
    "图片中这道菜的食材是什么？",
    "你能列出照片中这道菜的成分吗？",
    "图片中的这道菜是由什么组成的？"
]

receipe_questions = [
    "你能详细说明这道菜的制作步骤吗？",
    "你能提供一个重现这道菜的食谱或指南吗？",
    "你能提供一个重现这道菜的指南吗？",
    "你能提供一个重现这道菜的食谱吗？",
    "你能详细说明这道菜的烹饪步骤吗？",
    "怎么制作这道菜？",
    "如何制作这道菜？",
    "你能提供烹饪这道菜的说明吗？",
    "制作图片中这道菜的步骤或说明是什么？",
    "如何准备照片中展示的这道菜？",
    "你能描述图片中这道菜的食谱或制作过程吗？"
]